"""Создать список состоящий из отдельных единичных символов, преобразовать список
в строку, инвертировать строку и вывести на печать."""

my_list = ["o", "a", "r", "e"]
my_str = "".join(my_list)
print(my_str[::-1])












