"""Написать функцию которая возвращают случайным образом одну карту из стандартной колоды в 36 карт,
 где на первом месте номинал карты номинал (6 - 10, J, D, K, A),
  а на втором название масти (Hearts, Diamonds, Clubs, Spades)."""


koloda = [6,7,8,9,10,2,3,4,11] * 4



import random



print(koloda)